bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY26.xml
                </instance>
            </module>
            <module name="LOCKBIT">
                <instance name="LOCKBIT" caption="Lockbits">
                    <register-group name="LOCKBIT" name-in-module="LOCKBIT" offset="0" address-space="lockbits"
                                    caption="Lockbits"/>
                </instance>
            </module>
        </peripherals>
        <interrupts>
            <interrupt index="0" name="RESET" caption="External Reset, Power-on Reset and Watchdog Reset"/>
            <interrupt index="1" name="INT0" caption="External Interrupt 0"/>
            <interrupt index="2" name="IO_PINS" caption="External Interrupt Request 0"/>
            <interrupt index="3" name="TIMER1_CMPA" caption="Timer/Counter1 Compare Match 1A"/>
            <interrupt index="4" name="TIMER1_CMPB" caption="Timer/Counter1 Compare Match 1B"/>
            <interrupt index="5" name="TIMER1_OVF1" caption="Timer/Counter1 Overflow"/>
            <interrupt index="6" name="TIMER0_OVF0" caption="Timer/Counter0 Overflow"/>
            <interrupt index="7" name="USI_STRT" caption="USI Start"/>
            <interrupt index="8" name="USI_OVF" caption="USI Overflow"/>
            <interrupt index="9" name="EE_RDY" caption="EEPROM Ready"/>
            <interrupt index="10" name="ANA_COMP" caption="Analog Comparator"/>
            <interrupt index="11" name="ADC" caption="ADC Conversion Complete"/>
        </interrupts>
        <interfaces>
            <interface name="ISP" type="isp"/>
            <interface name="HVPP" type="hvpp"/>
        </interfaces>
        <property-groups>
            <property-group name="SIGNATURES">
                <property name="SIGNATURE0" value="0x1e"/>
                <property name="SIGNATURE1" value="0x91"/>
                <property name="SIGNATURE2" value="0x09"/>
            </property-group>
            <property-group name="ISP_INTERFACE">
                <property name="IspEnterProgMode_timeout" value="200"/>
                <property name="IspEnterProgMode_stabDelay" value="100"/>
                <property name="IspEnterProgMode_cmdexeDelay" value="25"/>
                <property name="IspEnterProgMode_synchLoops" value="32"/>
                <property name="IspEnterProgMode_byteDelay" value="0"/>
                <property name="IspEnterProgMode_pollIndex" value="3"/>
                <property name="IspEnterProgMode_pollValue" value="0x53"/>
                <property name="IspLeaveProgMode_preDelay" value="1"/>
                <property name="IspLeaveProgMode_postDelay" value="1"/>
                <property name="IspChipErase_eraseDelay" value="20"/>
                <property name="IspChipErase_pollMethod" value="0"/>
                <property name="IspProgramFlash_mode" value="0x21"/>
                <property name="IspProgramFlash_blockSize" value="16"/>
                <property name="IspProgramFlash_delay" value="10"/>
                <property name="IspProgramFlash_cmd1" value="0x40"/>
                <property name="IspProgramFlash_cmd2" value="0x4C"/>
                <property name="IspProgramFlash_cmd3" value="0x20"/>
                <property name="IspProgramFlash_pollVal1" value="0xFF"/>
                <property name="IspProgramFlash_pollVal2" value="0x00"/>
                <property name="IspProgramEeprom_mode" value="0x04"/>
                <property name="IspProgramEeprom_blockSize" value="64"/>
                <property name="IspProgramEeprom_delay" value="20"/>
                <property name="IspProgramEeprom_cmd1" value="0xC0"/>
                <property name="IspProgramEeprom_cmd2" value="0x00"/>
                <property name="IspProgramEeprom_cmd3" value="0xA0"/>
                <property name="IspProgramEeprom_pollVal1" value="0xFF"/>
                <property name="IspProgramEeprom_pollVal2" value="0xFF"/>
                <property name="IspReadFlash_blockSize" value="256"/>
                <property name="IspReadEeprom_blockSize" value="256"/>
                <property name="IspReadFuse_pollIndex" value="4"/>
                <property name="IspReadLock_pollIndex" value="4"/>
                <property name="IspReadSign_pollIndex" value="4"/>
                <property name="IspReadOsccal_pollIndex" value="4"/>
            </property-group>
            <property-group name="PP_INTERFACE">
                <property name="PpControlStack"
                          value="0xC4 0xE4 0xC4 0xE4 0xCC 0xEC 0xCC 0xEC 0xD4 0xF4 0xD4 0xF4 0xDC 0xFC 0xDC 0xFC 0xC8 0xE8 0xD8 0xF8 0x4C 0x6C 0x5C 0x7C 0xEC 0xBC 0x00 0x06 0x00 0x00 0x00 0x00"/>
                <property name="PpEnterProgMode_stabDelay" value="100"/>
                <property name="PpEnterProgMode_progModeDelay" value="0"/>
                <property name="PpEnterProgMode_latchCycles" value="5"/>
                <property name="PpEnterProgMode_toggleVtg" value="1"/>
                <property name="PpEnterProgMode_powerOffDelay" value="15"/>
                <property name="PpEnterProgMode_resetDelayMs" value="2"/>
                <property name="PpEnterProgMode_resetDelayUs" value="0"/>
                <property name="PpLeaveProgMode_stabDelay" value="15"/>
                <property name="PpLeaveProgMode_resetDelay" value="15"/>
                <property name="PpChipErase_pulseWidth" value="0"/>
                <property name="PpChipErase_pollTimeout" value="20"/>
                <property name="PpProgramFlash_pollTimeout" value="10"/>
                <property name="PpProgramFlash_mode" value="0x0B"/>
                <property name="PpProgramFlash_blockSize" value="256"/>
                <property name="PpReadFlash_blockSize" value="256"/>
                <property name="PpProgramEeprom_pollTimeout" value="10"/>
                <property name="PpProgramEeprom_mode" value="0x05"/>
                <property name="PpProgramEeprom_blockSize" value="256"/>
                <property name="PpReadEeprom_blockSize" value="256"/>
                <property name="PpProgramFuse_pulseWidth" value="0"/>
                <property name="PpProgramFuse_pollTimeout" value="10"/>
                <property name="PpProgramLock_pulseWidth" value="0"/>
                <property name="PpProgramLock_pollTimeout" value="10"/>
            </property-group>
            <property-group name="ISP_INTERFACE_STK600">
                <property name="IspEnterProgMode_timeout" value="200"/>
                <property name="IspEnterProgMode_stabDelay" value="100"/>
                <property name="IspEnterProgMode_cmdexeDelay" value="25"/>
                <property name="IspEnterProgMode_synchLoops" value="32"/>
                <property name="IspEnterProgMode_byteDelay" value="0"/>
                <property name="IspEnterProgMode_pollIndex" value="3"/>
                <property name="IspEnterProgMode_pollValue" value="0x53"/>
                <property name="IspLeaveProgMode_preDelay" value="1"/>
                <property name="IspLeaveProgMode_postDelay" value="1"/>
                <property name="IspChipErase_eraseDelay" value="20"/>
                <property name="IspChipErase_pollMethod" value="0"/>
                <property name="IspProgramFlash_mode" value="0x21"/>
                <property name="IspProgramFlash_blockSize" value="16"/>
                <property name="IspProgramFlash_delay" value="6"/>
                <property name="IspProgramFlash_cmd1" value="0x40"/>
                <property name="IspProgramFlash_cmd2" value="0x4C"/>
                <property name="IspProgramFlash_cmd3" value="0x20"/>
                <property name="IspProgramFlash_pollVal1" value="0xFF"/>
                <property name="IspProgramFlash_pollVal2" value="0x00"/>
                <property name="IspProgramEeprom_mode" value="0x04"/>
                <property name="IspProgramEeprom_blockSize" value="64"/>
                <property name="IspProgramEeprom_delay" value="10"/>
                <property name="IspProgramEeprom_cmd1" value="0xC0"/>
                <property name="IspProgramEeprom_cmd2" value="0x00"/>
                <property name="IspProgramEeprom_cmd3" value="0xA0"/>
                <property name="IspProgramEeprom_pollVal1" value="0xFF"/>
                <property name="IspProgramEeprom_pollVal2" value="0xFF"/>
                <property name="IspReadFlash_blockSize" value="256"/>
                <property name="IspReadEeprom_blockSize" value="256"/>
                <property name="IspReadFuse_pollIndex" value="4"/>
                <property name="IspReadLock_pollIndex" value="4"/>
                <property name="IspReadSign_pollIndex" value="4"/>
                <property name="IspReadOsccal_pollIndex" value="4"/>
            </property-group>
            <property-group name="PP_INTERFACE_STK600">
                <property name="PpControlStack"
                          value="0x0E 0x1E 0x0E 0x1E 0x2E 0x3E 0x2E 0x3E 0x4E 0x5E 0x4E 0x5E 0x6E 0x7E 0x6E 0x7E 0x06 0x16 0x46 0x56 0x0A 0x1A 0x4A 0x5A 0x1E 0x7C 0x00 0x01 0x00 0x00 0x00 0x00"/>
                <property name="PpEnterProgMode_stabDelay" value="100"/>
                <property name="PpEnterProgMode_progModeDelay" value="0"/>
                <property name="PpEnterProgMode_latchCycles" value="5"/>
                <property name="PpEnterProgMode_toggleVtg" value="1"/>
                <property name="PpEnterProgMode_powerOffDelay" value="20"/>
                <property name="PpEnterProgMode_resetDelayMs" value="2"/>
                <property name="PpEnterProgMode_resetDelayUs" value="0"/>
                <property name="PpLeaveProgMode_stabDelay" value="15"/>
                <property name="PpLeaveProgMode_resetDelay" value="15"/>
                <property name="PpChipErase_pulseWidth" value="0"/>
                <property name="PpChipErase_pollTimeout" value="20"/>
                <property name="PpProgramFlash_pollTimeout" value="10"/>
                <property name="PpProgramFlash_mode" value="0x0B"/>
                <property name="PpProgramFlash_blockSize" value="256"/>
                <property name="PpReadFlash_blockSize" value="256"/>
                <property name="PpProgramEeprom_pollTimeout" value="10"/>
                <property name="PpProgramEeprom_mode" value="0x05"/>
                <property name="PpProgramEeprom_blockSize" value="256"/>
                <property name="PpReadEeprom_blockSize" value="256"/>
                <property name="PpProgramFuse_pulseWidth" value="0"/>
                <property name="PpProgramFuse_pollTimeout" value="10"/>
                <property name="PpProgramLock_pulseWidth" value="0"/>
                <property name="PpProgramLock_pollTimeout" value="10"/>
            </property-group>
            <property-group name="PP_INTERFACE_AVRDRAGON">
                <property name="PpControlStack"
                          value="0xC4 0xE4 0xC4 0xE4 0xCC 0xEC 0xCC 0xEC 0xD4 0xF4 0xD4 0xF4 0xDC 0xFC 0xDC 0xFC 0xC8 0xE8 0xD8 0xF8 0x4C 0x6C 0x5C 0x7C 0xEC 0xBC 0x80 0x06 0x00 0x00 0x00 0x00"/>
                <property name="PpEnterProgMode_stabDelay" value="100"/>
                <property name="PpEnterProgMode_progModeDelay" value="0"/>
                <property name="PpEnterProgMode_latchCycles" value="5"/>
                <property name="PpEnterProgMode_toggleVtg" value="1"/>
                <property name="PpEnterProgMode_powerOffDelay" value="15"/>
                <property name="PpEnterProgMode_resetDelayMs" value="2"/>
                <property name="PpEnterProgMode_resetDelayUs" value="0"/>
                <property name="PpLeaveProgMode_stabDelay" value="15"/>
                <property name="PpLeaveProgMode_resetDelay" value="15"/>
                <property name="PpChipErase_pulseWidth" value="0"/>
                <property name="PpChipErase_pollTimeout" value="20"/>
                <property name="PpProgramFlash_pollTimeout" value="10"/>
                <property name="PpProgramFlash_mode" value="0x0B"/>
                <property name="PpProgramFlash_blockSize" value="256"/>
                <property name="PpReadFlash_blockSize" value="256"/>
                <property name="PpProgramEeprom_pollTimeout" value="10"/>
                <property name="PpProgramEeprom_mode" value="0x05"/>
                <property name="PpProgramEeprom_blockSize" value="256"/>
                <property name="PpReadEeprom_blockSize" value="256"/>
                <property name="PpProgramFuse_pulseWidth" value="0"/>
                <property name="PpProgramFuse_pollTimeout" value="10"/>
                <property name="PpProgramLock_pulseWidth" value="0"/>
                <property name="PpProgramLock_pollTimeout" value="10"/>
            </property-group>
        </property-groups>
    </device>
    <modules>
        <module caption="Fuses" name="FUSE">
            <register-group caption="Fuses" name="FUSE">
                <register caption="" name="HIGH" offset="0x01" size="1" initval="0xF7">
                    <bitfield caption="Reset Disabled (Enable PB7 as i/o pin)" mask="0x10" name="RSTDISBL"/>
                    <bitfield caption="Serial program downloading (SPI) enabled" mask="0x08" name="SPIEN"/>
                    <bitfield caption="Preserve EEPROM through the Chip Erase cycle" mask="0x04" name="EESAVE"/>
                    <bitfield caption="Brownout detector trigger level" mask="0x02" name="BODLEVEL"
                              values="ENUM_BODLEVEL"/>
                    <bitfield caption="Brown-out detection enabled" mask="0x01" name="BODEN"/>
                </register>
                <register caption="" name="LOW" offset="0x00" size="1" initval="0xE1">
                    <bitfield caption="CKOPT fuse (operation dependent of CKSEL fuses)" mask="0x40" name="CKOPT"/>
                    <bitfield caption="Select Clock Source" mask="0xBF" name="PLLCK_SUT_CKSEL"
                              values="ENUM_PLLCK_SUT_CKSEL"/>
                </register>
            </register-group>
            <value-group caption="" name="ENUM_PLLCK_SUT_CKSEL">
                <value caption="PLL Clock; Start-up time: 1K CK + 0 ms" name="PLLCLK_1KCK_0MS" value="0x01"/>
                <value caption="PLL Clock; Start-up time: 1K CK + 4 ms" name="PLLCLK_1KCK_4MS" value="0x11"/>
                <value caption="PLL Clock; Start-up time: 1K CK + 64 ms" name="PLLCLK_1KCK_64MS" value="0x21"/>
                <value caption="PLL Clock; Start-up time: 16K CK + 64 ms" name="PLLCLK_16KCK_64MS" value="0x31"/>
                <value caption="Ext. Clock; Start-up time: 6 CK + 0 ms" name="EXTCLK_6CK_0MS" value="0x80"/>
                <value caption="Ext. Clock; Start-up time: 6 CK + 4 ms" name="EXTCLK_6CK_4MS" value="0x90"/>
                <value caption="Ext. Clock; Start-up time: 6 CK + 64 ms" name="EXTCLK_6CK_64MS" value="0xA0"/>
                <value caption="Int. RC Osc. 1 MHz; Start-up time: 6 CK + 0 ms" name="INTRCOSC_1MHZ_6CK_0MS"
                       value="0x81"/>
                <value caption="Int. RC Osc. 1 MHz; Start-up time: 6 CK + 4 ms" name="INTRCOSC_1MHZ_6CK_4MS"
                       value="0x91"/>
                <value caption="Int. RC Osc. 1 MHz; Start-up time: 6 CK + 64 ms" name="INTRCOSC_1MHZ_6CK_64MS"
                       value="0xA1"/>
                <value caption="Int. RC Osc. 2 MHz; Start-up time: 6 CK + 0 ms" name="INTRCOSC_2MHZ_6CK_0MS"
                       value="0x82"/>
                <value caption="Int. RC Osc. 2 MHz; Start-up time: 6 CK + 4 ms" name="INTRCOSC_2MHZ_6CK_4MS"
                       value="0x92"/>
                <value caption="Int. RC Osc. 2 MHz; Start-up time: 6 CK + 64 ms" name="INTRCOSC_2MHZ_6CK_64MS"
                       value="0xA2"/>
                <value caption="Int. RC Osc. 4 MHz; Start-up time: 6 CK + 0 ms" name="INTRCOSC_4MHZ_6CK_0MS"
                       value="0x83"/>
                <value caption="Int. RC Osc. 4 MHz; Start-up time: 6 CK + 4 ms" name="INTRCOSC_4MHZ_6CK_4MS"
                       value="0x93"/>
                <value caption="Int. RC Osc. 4 MHz; Start-up time: 6 CK + 64 ms" name="INTRCOSC_4MHZ_6CK_64MS"
                       value="0xA3"/>
                <value caption="Int. RC Osc. 8 MHz; Start-up time: 6 CK + 0 ms" name="INTRCOSC_8MHZ_6CK_0MS"
                       value="0x84"/>
                <value caption="Int. RC Osc. 8 MHz; Start-up time: 6 CK + 4 ms" name="INTRCOSC_8MHZ_6CK_4MS"
                       value="0x94"/>
                <value caption="Int. RC Osc. 8 MHz; Start-up time: 6 CK + 64 ms" name="INTRCOSC_8MHZ_6CK_64MS"
                       value="0xA4"/>
                <value caption="Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 0 ms"
                       name="EXTRCOSC_XX_0MHZ9_18CK_0MS" value="0x85"/>
                <value caption="Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 4 ms"
                       name="EXTRCOSC_XX_0MHZ9_18CK_4MS" value="0x95"/>
                <value caption="Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 64 ms"
                       name="EXTRCOSC_XX_0MHZ9_18CK_64MS" value="0xA5"/>
                <value caption="Ext. RC Osc.         -  0.9 MHz; Start-up time: 6 CK + 4 ms"
                       name="EXTRCOSC_XX_0MHZ9_6CK_4MS" value="0xB5"/>
                <value caption="Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 0 ms"
                       name="EXTRCOSC_0MHZ9_3MHZ_18CK_0MS" value="0x86"/>
                <value caption="Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 4 ms"
                       name="EXTRCOSC_0MHZ9_3MHZ_18CK_4MS" value="0x96"/>
                <value caption="Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 64 ms"
                       name="EXTRCOSC_0MHZ9_3MHZ_18CK_64MS" value="0xA6"/>
                <value caption="Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 6 CK + 4 ms"
                       name="EXTRCOSC_0MHZ9_3MHZ_6CK_4MS" value="0xB6"/>
                <value caption="Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 0 ms"
                       name="EXTRCOSC_3MHZ_8MHZ_18CK_0MS" value="0x87"/>
                <value caption="Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 4 ms"
                       name="EXTRCOSC_3MHZ_8MHZ_18CK_4MS" value="0x97"/>
                <value caption="Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 64 ms"
                       name="EXTRCOSC_3MHZ_8MHZ_18CK_64MS" value="0xA7"/>
                <value caption="Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 6 CK + 4 ms"
                       name="EXTRCOSC_3MHZ_8MHZ_6CK_4MS" value="0xB7"/>
                <value caption="Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 0 ms"
                       name="EXTRCOSC_8MHZ_12MHZ_18CK_0MS" value="0x88"/>
                <value caption="Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 4 ms"
                       name="EXTRCOSC_8MHZ_12MHZ_18CK_4MS" value="0x98"/>
                <value caption="Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 64 ms"
                       name="EXTRCOSC_8MHZ_12MHZ_18CK_64MS" value="0xA8"/>
                <value caption="Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 6 CK + 4 ms"
                       name="EXTRCOSC_8MHZ_12MHZ_6CK_4MS" value="0xB8"/>
                <value caption="Ext. Low-Freq. Crystal; Start-up time: 1K CK + 4 ms" name="EXTLOFXTAL_1KCK_4MS"
                       value="0x89"/>
                <value caption="Ext. Low-Freq. Crystal; Start-up time: 1K CK + 64 ms" name="EXTLOFXTAL_1KCK_64MS"
                       value="0x99"/>
                <value caption="Ext. Low-Freq. Crystal; Start-up time: 32K CK + 64 ms" name="EXTLOFXTAL_32KCK_64MS"
                       value="0xA9"/>
                <value caption="Ext. Crystal/Resonator Low Freq.; Start-up time: 258 CK + 4 ms"
                       name="EXTLOFXTALRES_258CK_4MS" value="0x8A"/>
                <value caption="Ext. Crystal/Resonator Low Freq.; Start-up time: 258 CK + 64 ms"
                       name="EXTLOFXTALRES_258CK_64MS" value="0x9A"/>
                <value caption="Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 0 ms"
                       name="EXTLOFXTALRES_1KCK_0MS" value="0xAA"/>
                <value caption="Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 4 ms"
                       name="EXTLOFXTALRES_1KCK_4MS" value="0xBA"/>
                <value caption="Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 64 ms"
                       name="EXTLOFXTALRES_1KCK_64MS" value="0x8B"/>
                <value caption="Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 0 ms"
                       name="EXTLOFXTALRES_16KCK_0MS" value="0x9B"/>
                <value caption="Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 4 ms"
                       name="EXTLOFXTALRES_16KCK_4MS" value="0xAB"/>
                <value caption="Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 64 ms"
                       name="EXTLOFXTALRES_16KCK_64MS" value="0xBB"/>
                <value caption="Ext. Crystal/Resonator Medium Freq.; Start-up time: 258 CK + 4 ms"
                       name="EXTMEDFXTALRES_258CK_4MS" value="0x8C"/>
                <value caption="Ext. Crystal/Resonator Medium Freq.; Start-up time: 258 CK + 64 ms"
                       name="EXTMEDFXTALRES_258CK_64MS" value="0x9C"/>
                <value caption="Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 0 ms"
                       name="EXTMEDFXTALRES_1KCK_0MS" value="0xAC"/>
                <value caption="Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 4 ms"
                       name="EXTMEDFXTALRES_1KCK_4MS" value="0xBC"/>
                <value caption="Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 64 ms"
                       name="EXTMEDFXTALRES_1KCK_64MS" value="0x8D"/>
                <value caption="Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 0 ms"
                       name="EXTMEDFXTALRES_16KCK_0MS" value="0x9D"/>
                <value caption="Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 4 ms"
                       name="EXTMEDFXTALRES_16KCK_4MS" value="0xAD"/>
                <value caption="Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 64 ms"
                       name="EXTMEDFXTALRES_16KCK_64MS" value="0xBD"/>
                <value caption="Ext. Crystal/Resonator High Freq.; Start-up time: 258 CK + 4 ms"
                       name="EXTHIFXTALRES_258CK_4MS" value="0x8E"/>
                <value caption="Ext. Crystal/Resonator High Freq.; Start-up time: 258 CK + 64 ms"
                       name="EXTHIFXTALRES_258CK_64MS" value="0x9E"/>
                <value caption="Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 0 ms"
                       name="EXTHIFXTALRES_1KCK_0MS" value="0xAE"/>
                <value caption="Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 4 ms"
                       name="EXTHIFXTALRES_1KCK_4MS" value="0xBE"/>
                <value caption="Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 64 ms"
                       name="EXTHIFXTALRES_1KCK_64MS" value="0x8F"/>
                <value caption="Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 0 ms"
                       name="EXTHIFXTALRES_16KCK_0MS" value="0x9F"/>
                <value caption="Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 4 ms"
                       name="EXTHIFXTALRES_16KCK_4MS" value="0xAF"/>
                <value caption="Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 64 ms"
                       name="EXTHIFXTALRES_16KCK_64MS" value="0xBF"/>
            </value-group>
            <value-group caption="" name="ENUM_BODLEVEL">
                <value caption="Brown-out detection at VCC=4.0 V" name="4V0" value="0x00"/>
                <value caption="Brown-out detection at VCC=2.7 V" name="2V7" value="0x01"/>
            </value-group>
        </module>
