bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY26.xml
        <module caption="Lockbits" name="LOCKBIT">
            <register-group caption="Lockbits" name="LOCKBIT">
                <register caption="" name="LOCKBIT" offset="0x00" size="1" initval="0xFF">
                    <bitfield caption="Memory Lock" mask="0x03" name="LB" values="ENUM_LB"/>
                </register>
            </register-group>
            <value-group caption="" name="ENUM_LB">
                <value caption="Further programming and verification disabled" name="PROG_VER_DISABLED" value="0x00"/>
                <value caption="Further programming disabled" name="PROG_DISABLED" value="0x02"/>
                <value caption="No memory lock features enabled" name="NO_LOCK" value="0x03"/>
            </value-group>
        </module>
        <module caption="Analog-to-Digital Converter" name="ADC">
            <register-group caption="Analog-to-Digital Converter" name="ADC">
                <register caption="The ADC multiplexer Selection Register" name="ADMUX" offset="0x27" size="1">
                    <bitfield caption="Reference Selection Bits" mask="0xC0" name="REFS" values="ANALOG_ADC_V_REF"/>
                    <bitfield caption="Left Adjust Result" mask="0x20" name="ADLAR"/>
                    <bitfield caption="Analog Channel and Gain Selection Bits" mask="0x1F" name="MUX"/>
                </register>
                <register caption="The ADC Control and Status register" name="ADCSR" offset="0x26" size="1">
                    <bitfield caption="ADC Enable" mask="0x80" name="ADEN"/>
                    <bitfield caption="ADC Start Conversion" mask="0x40" name="ADSC"/>
                    <bitfield caption="ADC  Free Running Select" mask="0x20" name="ADFR"/>
                    <bitfield caption="ADC Interrupt Flag" mask="0x10" name="ADIF"/>
                    <bitfield caption="ADC Interrupt Enable" mask="0x08" name="ADIE"/>
                    <bitfield caption="ADC  Prescaler Select Bits" mask="0x07" name="ADPS"
                              values="ANALOG_ADC_PRESCALER"/>
                </register>
                <register caption="ADC Data Register  Bytes" name="ADC" offset="0x24" size="2" mask="0xFFFF"/>
            </register-group>
            <value-group caption="" name="ANALOG_ADC_V_REF">
                <value caption="AVCC" name="VAL_0x00" value="0x00"/>
                <value caption="AREF" name="VAL_0x01" value="0x01"/>
                <value caption="Internal Voltage Referance" name="VAL_0x02" value="0x02"/>
                <value caption="Internal Voltage Reference With External Capacitor at AREF Pin." name="VAL_0x03"
                       value="0x03"/>
            </value-group>
            <value-group caption="" name="ANALOG_ADC_PRESCALER">
                <value caption="2" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Analog Comparator" name="AC">
            <register-group caption="Analog Comparator" name="AC">
                <register caption="Analog Comparator Control And Status Register" name="ACSR" offset="0x28" size="1">
                    <bitfield caption="Analog Comparator Disable" mask="0x80" name="ACD"/>
                    <bitfield caption="Analog Comparator Bandgap Select" mask="0x40" name="ACBG"/>
                    <bitfield caption="Analog Compare Output" mask="0x20" name="ACO"/>
                    <bitfield caption="Analog Comparator Interrupt Flag" mask="0x10" name="ACI"/>
                    <bitfield caption="Analog Comparator Interrupt Enable" mask="0x08" name="ACIE"/>
                    <bitfield caption="Analog Comparator Multiplexer Enable" mask="0x04" name="ACME"/>
                    <bitfield caption="Analog Comparator Interrupt Mode Select bits" mask="0x03" name="ACIS"
                              values="ANALOG_COMP_INTERRUPT"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_COMP_INTERRUPT">
                <value caption="Interrupt on Toggle" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Interrupt on Falling Edge" name="VAL_0x02" value="0x02"/>
                <value caption="Interrupt on Rising Edge" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="Universal Serial Interface" name="USI">
            <register-group caption="Universal Serial Interface" name="USI">
                <register caption="USI Data Register" name="USIDR" offset="0x2F" size="1" mask="0xFF"/>
                <register caption="USI Status Register" name="USISR" offset="0x2E" size="1" ocd-rw="R">
                    <bitfield caption="Start Condition Interrupt Flag" mask="0x80" name="USISIF"/>
                    <bitfield caption="Counter Overflow Interrupt Flag" mask="0x40" name="USIOIF"/>
                    <bitfield caption="Stop Condition Flag" mask="0x20" name="USIPF"/>
                    <bitfield caption="Data Output Collision" mask="0x10" name="USIDC"/>
                    <bitfield caption="USI Counter Value Bits" mask="0x0F" name="USICNT"/>
                </register>
                <register caption="USI Control Register" name="USICR" offset="0x2D" size="1">
                    <bitfield caption="Start Condition Interrupt Enable" mask="0x80" name="USISIE"/>
                    <bitfield caption="Counter Overflow Interrupt Enable" mask="0x40" name="USIOIE"/>
                    <bitfield caption="USI Wire Mode Bits" mask="0x30" name="USIWM" values="COMM_USI_OP"/>
                    <bitfield caption="USI Clock Source Select Bits" mask="0x0C" name="USICS"/>
                    <bitfield caption="Clock Strobe" mask="0x02" name="USICLK"/>
                    <bitfield caption="Toggle Clock Port Pin" mask="0x01" name="USITC"/>
                </register>
            </register-group>
            <value-group caption="" name="COMM_USI_OP">
                <value caption="Normal Operation" name="VAL_0x00" value="0x00"/>
                <value caption="Three-Wire Mode" name="VAL_0x01" value="0x01"/>
                <value caption="Two-Wire Mode" name="VAL_0x02" value="0x02"/>
                <value caption="Two-Wire Mode Held Low" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="I/O Port" name="PORT">
            <register-group caption="I/O Port" name="PORTA">
                <register caption="Port A Data Register" name="PORTA" offset="0x3B" size="1" mask="0xFF"/>
                <register caption="Port A Data Direction Register" name="DDRA" offset="0x3A" size="1" mask="0xFF"/>
                <register caption="Port A Input Pins" name="PINA" offset="0x39" size="1" mask="0xFF" ocd-rw="R"/>
            </register-group>
