bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY26.xml
                <register caption="Timer/Counter Interrupt Flag register" name="TIFR" offset="0x58" size="1">
                    <bitfield caption="Timer/Counter0 Overflow Flag" mask="0x02" name="TOV0"/>
                </register>
                <register caption="Timer/Counter0 Control Register" name="TCCR0" offset="0x53" size="1">
                    <bitfield caption="Prescaler Reset Timer/Counter0" mask="0x08" name="PSR0"/>
                    <bitfield caption="Clock Select0 bits" mask="0x07" name="CS0" values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer Counter 0" name="TCNT0" offset="0x52" size="1" mask="0xFF"/>
            </register-group>
            <register-group caption="Timer/Counter, 8-bit" name="TC1">
                <register caption="Timer/Counter Control Register A" name="TCCR1A" offset="0x50" size="1">
                    <bitfield caption="Comparator A Output Mode Bits" mask="0xC0" name="COM1A"
                              values="CLK_COMP_MATCH_OUT_MODE"/>
                    <bitfield caption="Comparator B Output Mode Bits" mask="0x30" name="COM1B"
                              values="CLK_COMP_MATCH_OUT_MODE"/>
                    <bitfield caption="Force Output Compare Match 1A" mask="0x08" name="FOC1A"/>
                    <bitfield caption="Force Output Compare Match 1B" mask="0x04" name="FOC1B"/>
                    <bitfield caption="Pulse Width Modulator A Enable" mask="0x02" name="PWM1A"/>
                    <bitfield caption="Pulse Width Modulator B Enable" mask="0x01" name="PWM1B"/>
                </register>
                <register caption="Timer/Counter Control Register B" name="TCCR1B" offset="0x4F" size="1">
                    <bitfield caption="Clear Timer/Counter on Compare Match" mask="0x80" name="CTC1"/>
                    <bitfield caption="Prescaler Reset Timer/Counter1" mask="0x40" name="PSR1"/>
                    <bitfield caption="Clock Select Bits" mask="0x0F" name="CS1" values="CLK_SEL_4BIT"/>
                </register>
                <register caption="Timer/Counter Register" name="TCNT1" offset="0x4E" size="1" mask="0xFF"/>
                <register caption="Output Compare Register" name="OCR1A" offset="0x4D" size="1" mask="0xFF"/>
                <register caption="Output Compare Register" name="OCR1B" offset="0x4C" size="1" mask="0xFF"/>
                <register caption="Output Compare Register" name="OCR1C" offset="0x4B" size="1" mask="0xFF"/>
                <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK" offset="0x59" size="1">
                    <bitfield caption="Timer/Counter1 Output Compare Interrupt Enable" mask="0x40" name="OCIE1A"/>
                    <bitfield caption="Timer/Counter1 Output Compare Interrupt Enable" mask="0x20" name="OCIE1B"/>
                    <bitfield caption="Timer/Counter1 Overflow Interrupt Enable" mask="0x04" name="TOIE1"/>
                </register>
                <register caption="Timer/Counter Interrupt Flag Register" name="TIFR" offset="0x58" size="1">
                    <bitfield caption="Timer/Counter1 Output Compare Flag 1A" mask="0x40" name="OCF1A"/>
                    <bitfield caption="Timer/Counter1 Output Compare Flag 1B" mask="0x20" name="OCF1B"/>
                    <bitfield caption="Timer/Counter1 Overflow Flag" mask="0x04" name="TOV1"/>
                </register>
                <register caption="PLL Control and Status Register" name="PLLCSR" offset="0x49" size="1">
                    <bitfield caption="PCK Enable" mask="0x04" name="PCKE"/>
                    <bitfield caption="PLL Enable" mask="0x02" name="PLLE"/>
                    <bitfield caption="PLL Lock Detector" mask="0x01" name="PLOCK"/>
                </register>
            </register-group>
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
            <value-group caption="" name="CLK_COMP_MATCH_OUT_MODE">
                <value caption="Disconnected from OCn/PWMn" name="VAL_0x00" value="0x00"/>
                <value caption="Toggle OCn/PWMn output line" name="VAL_0x01" value="0x01"/>
                <value caption="Clear OCn/PWMn output line" name="VAL_0x02" value="0x02"/>
                <value caption="set OCn/PWMn output line" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="CLK_SEL_4BIT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/2" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/4" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/8" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/16" name="VAL_0x05" value="0x05"/>
                <value caption="Running, CLK/32" name="VAL_0x06" value="0x06"/>
                <value caption="Running, CLK/64" name="VAL_0x07" value="0x07"/>
                <value caption="Running, CLK/128" name="VAL_0x08" value="0x08"/>
                <value caption="Running, CLK/256" name="VAL_0x09" value="0x09"/>
                <value caption="Running, CLK/512" name="VAL_0x0A" value="0x0A"/>
                <value caption="Running, CLK/1024" name="VAL_0x0B" value="0x0B"/>
                <value caption="Running, CLK/2048" name="VAL_0x0C" value="0x0C"/>
                <value caption="Running, CLK/4096" name="VAL_0x0D" value="0x0D"/>
                <value caption="Running, CLK/8192" name="VAL_0x0E" value="0x0E"/>
                <value caption="Running, CLK/16384" name="VAL_0x0F" value="0x0F"/>
            </value-group>
        </module>
        <module caption="External Interrupts" name="EXINT">
            <register-group caption="External Interrupts" name="EXINT">
                <register caption="General Interrupt Mask Register" name="GIMSK" offset="0x5B" size="1">
                    <bitfield caption="External Interrupt Request 0 Enable" mask="0x40" name="INT0"/>
                    <bitfield caption="Pin Change Interrupt Enables" mask="0x30" name="PCIE"/>
                </register>
                <register caption="General Interrupt Flag register" name="GIFR" offset="0x5A" size="1">
                    <bitfield caption="External Interrupt Flag 0" mask="0x40" name="INTF0"/>
                    <bitfield caption="Pin Change Interrupt Flag" mask="0x20" name="PCIF"/>
                </register>
            </register-group>
        </module>
    </modules>
</target-description-file>
